# Cleaning up datasets in fast.ai
Walkthrough of how to clean up datasets using the facilities in fast.ai.

In [1]:
# imports for notebook boilerplate
!pip install -Uqq fastbook
import fastbook
from fastbook import *
from fastai.text.all import *
from fastai.vision.all import *
from fastai.tabular.all import *

In [2]:
# set up the notebook for fast.ai
fastbook.setup_book()

In [3]:
# ingest the curated tabular dataset ADULT_SAMPLE
path = untar_data(URLs.ADULT_SAMPLE)

In [4]:
# ingest the dataset into a Pandas dataframe and count the number of missing values in each column
df = pd.read_csv(path/'adult.csv')
df.isnull().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education-num     487
marital-status      0
occupation        512
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country      0
salary              0
dtype: int64

In [5]:
# define the parameters for TabularPandas

# define transforms to apply to the tabular dataset
procs = [FillMissing,Categorify]
# define the dependent variable (y value)
dep_var = 'salary'
# define columns that are continuous / categorical
cont,cat = cont_cat_split(df, 1, dep_var=dep_var)

In [6]:
# define TabularPandas using the parameters just defined
df_no_missing = TabularPandas(df,procs, cat, cont,y_names = dep_var)

In [7]:
# show the result with the show API which preserves the original values
df_no_missing.show(3)

In [8]:
# show the result with the items.head() API which shows the non-numeric categorical values transformed to numeric IDs
df_no_missing.items.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,education-num_na
0,49,5,101320,8,12.0,3,0,6,5,1,0,1902,40,40,1,1
1,44,5,236746,13,14.0,1,5,2,5,2,10520,0,45,40,1,1
2,38,5,96185,12,10.0,1,0,5,3,1,0,0,32,40,0,2

In [9]:
# confirm that the missing values have been dealt with
df_no_missing.items.isnull().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation          0
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country      0
salary              0
education-num_na    0
dtype: int64